## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.tftest-mjw-mtasts.azurerm_cdn_endpoint.mtastsendpoint will be created
  + resource "azurerm_cdn_endpoint" "mtastsendpoint" {
      + fqdn                          = (known after apply)
      + id                            = (known after apply)
      + is_http_allowed               = false
      + is_https_allowed              = true
      + location                      = "global"
      + name                          = "cdnmwtftestmtasts"
      + origin_host_header            = (known after apply)
      + profile_name                  = "cdn-mjwmtasts"
      + querystring_caching_behaviour = "IgnoreQueryString"
      + resource_group_name           = "rg-whitefam-cdnprofiles"
      + tags                          = {
          + "managed" = "as-code"
          + "source"  = "terraform"
        }

      + delivery_rule {
          + name  = "EnforceHTTPS"
          + order = 1

          + request_scheme_condition {
              + match_values     = [
                  + "HTTP",
                ]
              + negate_condition = false
              + operator         = "Equal"
            }

          + url_redirect_action {
              + protocol      = "Https"
              + redirect_type = "Found"
            }
        }

      + origin {
          + host_name  = (known after apply)
          + http_port  = 80
          + https_port = 443
          + name       = "mtasts-endpoint"
        }
    }

  # module.tftest-mjw-mtasts.azurerm_cdn_endpoint_custom_domain.mtastscustomdomain will be created
  + resource "azurerm_cdn_endpoint_custom_domain" "mtastscustomdomain" {
      + cdn_endpoint_id = (known after apply)
      + host_name       = "mta-sts.tfttest.matthewjwhite.co.uk"
      + id              = (known after apply)
      + name            = "cdnmwtftestmtasts"

      + cdn_managed_https {
          + certificate_type = "Dedicated"
          + protocol_type    = "ServerNameIndication"
          + tls_version      = "TLS12"
        }
    }

  # module.tftest-mjw-mtasts.azurerm_dns_cname_record.cdnverify will be created
  + resource "azurerm_dns_cname_record" "cdnverify" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cdnverify.mta-sts"
      + record              = "cdnverify.cdnmwtftestmtasts.azureedge.net"
      + resource_group_name = "rg-whitefam-dnszones"
      + tags                = {
          + "managed" = "as-code"
          + "source"  = "terraform"
        }
      + ttl                 = 300
      + zone_name           = "tfttest.matthewjwhite.co.uk"
    }

  # module.tftest-mjw-mtasts.azurerm_dns_cname_record.mta-sts will be created
  + resource "azurerm_dns_cname_record" "mta-sts" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "mta-sts"
      + resource_group_name = "rg-whitefam-dnszones"
      + tags                = {
          + "managed" = "as-code"
          + "source"  = "terraform"
        }
      + target_resource_id  = (known after apply)
      + ttl                 = 300
      + zone_name           = "tfttest.matthewjwhite.co.uk"
    }

  # module.tftest-mjw-mtasts.azurerm_storage_account.stmtasts will be created
  + resource "azurerm_storage_account" "stmtasts" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "GRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = false
      + location                           = "uksouth"
      + min_tls_version                    = "TLS1_2"
      + name                               = "stmwtftestmtasts"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "RG-WhiteFam-UKS"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "managed" = "as-code"
          + "source"  = "terraform"
        }

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = false

          + container_delete_retention_policy {
              + days = 7
            }

          + delete_retention_policy {
              + days                     = 7
              + permanent_delete_enabled = false
            }
        }

      + network_rules {
          + bypass                     = [
              + "AzureServices",
            ]
          + default_action             = "Deny"
          + ip_rules                   = [
              + "102.133.216.88/29",
              + "102.133.56.88/29",
              + "13.73.248.16/29",
              + "147.243.0.0/16",
              + "157.55.93.2",
              + "157.55.93.3",
              + "158.23.108.56/29",
              + "172.204.165.112/29",
              + "172.207.68.70",
              + "172.207.68.71",
              + "172.207.69.80/30",
              + "191.233.9.120/29",
              + "191.235.225.128/29",
              + "20.113.254.88/29",
              + "20.115.247.64/29",
              + "20.118.195.128/29",
              + "20.119.155.128/29",
              + "20.150.160.96/29",
              + "20.17.126.64/29",
              + "20.189.106.112/29",
              + "20.192.161.104/29",
              + "20.192.225.48/29",
              + "20.21.37.40/29",
              + "20.210.70.64/30",
              + "20.215.4.240/29",
              + "20.217.44.240/29",
              + "20.36.120.104/29",
              + "20.37.156.120/29",
              + "20.37.195.0/29",
              + "20.37.224.104/29",
              + "20.37.64.104/29",
              + "20.38.136.104/29",
              + "20.38.84.72/29",
              + "20.39.11.8/29",
              + "20.41.192.104/29",
              + "20.41.4.88/29",
              + "20.41.64.120/29",
              + "20.42.129.152/29",
              + "20.42.224.104/29",
              + "20.42.4.120/29",
              + "20.43.130.80/29",
              + "20.43.41.136/29",
              + "20.43.65.128/29",
              + "20.45.112.104/29",
              + "20.45.192.104/29",
              + "20.59.103.64/29",
              + "20.72.18.248/29",
              + "20.79.107.152/29",
              + "20.88.157.176/29",
              + "20.90.132.152/29",
              + "4.213.28.114",
              + "4.213.28.115",
              + "4.213.81.64/29",
              + "4.232.98.120/29",
              + "40.67.48.104/29",
              + "40.74.30.72/29",
              + "40.80.168.104/29",
              + "40.80.184.120/29",
              + "40.80.56.104/29",
              + "40.82.248.248/29",
              + "40.89.16.104/29",
              + "51.104.25.128/29",
              + "51.105.80.104/29",
              + "51.105.88.104/29",
              + "51.107.144.104/29",
              + "51.107.48.104/29",
              + "51.12.193.8/29",
              + "51.12.41.8/29",
              + "51.120.224.104/29",
              + "51.120.40.104/29",
              + "51.137.160.112/29",
              + "51.143.192.104/29",
              + "51.53.30.144/29",
              + "52.136.48.104/29",
              + "52.140.104.104/29",
              + "52.150.136.120/29",
              + "52.159.71.160/29",
              + "52.228.80.120/29",
              + "62.3.75.22",
              + "68.210.172.176/29",
              + "68.221.93.128/29",
              + "69.15.0.0/16",
            ]
          + virtual_network_subnet_ids = (known after apply)
        }

      + queue_properties (known after apply)

      + routing (known after apply)

      + sas_policy {
          + expiration_action = "Log"
          + expiration_period = "30.00:00:00"
        }

      + share_properties (known after apply)

      + static_website {
          + error_404_document = "error.htm"
          + index_document     = "index.htm"
        }
    }

  # module.tftest-mjw-mtasts.azurerm_storage_blob.error will be created
  + resource "azurerm_storage_blob" "error" {
      + access_tier            = (known after apply)
      + content_type           = "text/html"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "error.htm"
      + parallelism            = 8
      + size                   = 0
      + source_content         = "<html><head><title>Error Page</title></head><body><center><h1>Nothing to see</h1></center></body></html>"
      + storage_account_name   = "stmwtftestmtasts"
      + storage_container_name = "$web"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # module.tftest-mjw-mtasts.azurerm_storage_blob.index will be created
  + resource "azurerm_storage_blob" "index" {
      + access_tier            = (known after apply)
      + content_type           = "text/html"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "index.htm"
      + parallelism            = 8
      + size                   = 0
      + source_content         = "<html><head><title>Nothing to see</title></head><body><center><h1>Nothing to see</h1></center></body></html>"
      + storage_account_name   = "stmwtftestmtasts"
      + storage_container_name = "$web"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # module.tftest-mjw-mtasts.azurerm_storage_blob.mta-sts will be created
  + resource "azurerm_storage_blob" "mta-sts" {
      + access_tier            = (known after apply)
      + content_type           = "text/plain"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = ".well-known/mta-sts.txt"
      + parallelism            = 8
      + size                   = 0
      + source_content         = <<-EOT
            version: STSv1
            mode: testing
            mx: tftest-mjw.mail.protection.outlook.com
            max_age: 86400
        EOT
      + storage_account_name   = "stmwtftestmtasts"
      + storage_container_name = "$web"
      + type                   = "Block"
      + url                    = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.
```
</details>